tests/stress_test.yml
config:
  target: "{{$processEnvironment.API_URL}}"
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Warm up
  processor: "./utilities/utilities.js"
  environments:
    js:
      target: "https://c320u3kjjf.execute-api.us-east-1.amazonaws.com/tesis"
    python:
      target: "https://e1ib5jr340.execute-api.us-east-1.amazonaws.com/tesis"
    java:
      target: "https://b560n6l4r0.execute-api.us-east-1.amazonaws.com/tesis"
scenarios:
  - name: "Stress test scenario"
    flow:
      - get:
          url: "/forms/getFormByTitle"
          qs:
            title: "Censo 2022"
          capture:
            - json: "$"
              as: "form"
      - post:
          url: "https://c320u3kjjf.execute-api.us-east-1.amazonaws.com/tesis/results/randomResults"
          json: "{{ form }}"
          capture:
            - json: "$"
              as: "randomResult"
      - post:
          url: "/results"
          json: "{{ randomResult }}"
          capture:
            - json: "$"
              as: "savedResult"
      - function: "processIds"
      - put:
          url: "/results/{{ resultPK }}"
          json: "{{ savedResult }}"
      - delete:
          url: "/results/{{ resultPK }}?formId={{ resultSK }}"